using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace LNK.MoreDeepFloor.Data.Defenders
{
    public enum DefenderId
    {
        None = 0,
        
        //#. 지휘관
        루리엘 = 10,
        
        
        //#. elf
        엘프_None = 100,
        엘프_소서러 = 101,
        엘프_수호자 = 102,
        엘프_사냥꾼 = 103,
        엘프_사제 = 104,
        엘프_그림자 = 105,
        숲지기 = 107,
        비취전차 = 108,
        엘프_워리어 = 109,
        루리엘_그렌타 = 110,
        

        #region #. 테스트

        //#. 녹서스
        녹서스_트리스타나 = 10001,
        녹서스_사이온 = 10002,
        녹서스_탈론 = 10003,
        녹서스_스웨인 = 10004,
        녹서스_카타리나 = 10005,
        녹서스_리븐 = 10006,
        녹서스_드레이븐 = 10007,
        녹서스_모데카이저 = 10008,
        녹서스_사미라 = 10009,
        
        //#. 타곤
        타곤_말파이트 = 10011,
        타곤_아펠리오스 = 10012,
        타곤_다이애나 = 10013,
        타곤_나미 = 10014,
        타곤_판테온 = 10015,
        타곤_조이 = 10016,
        타곤_타릭 = 10017,
        타곤_소라카 = 10018,
        타곤_레오나 = 10019,
        
        //#. 그림자군도
        그림자군도_비에고 = 10021,
        그림자군도_엘리스 = 10022,
        그림자군도_백스 = 10023,
        그림자군도_쓰레쉬 = 10024,
        그림자군도_마오카이 = 10025,
        그림자군도_칼리스타 = 10026,
        그림자군도_카서스 = 10027,
        그림자군도_헤카림 = 10028,
        그림자군도_그웬 = 10029,

        #endregion
    }
}
